eziya/STM32_SECURITY_LAB/TEST_PROJECTS/STM32CubeExpansion_SBSFU_V2.6.1/Projects/NUCLEO-L476RG/Applications/2_Images/2_Images_SBSFU/SBSFU/App/sfu_boot.c
      /* Call the State Machine function associated to the current state */
      //현재 상태에 따른 함수 호출
      fnStateMachineFunction();
    }
    else
    {
      e_ret_status = SFU_ERROR;
    }
  }

  /* If the State Machine cannot evolve anymore, reboot is the only option */

  /* Set the error before forcing a reboot */
  //에러 발생 시 에러 처리
  SFU_EXCPT_SetError(SFU_EXCPT_UNKNOWN);

  /* This is the last operation executed. Force a System Reset */
  //에러 발생 시 재부팅
  SFU_BOOT_ForceReboot();

  return e_ret_status;
}

/** @brief  Check the Reset status in order to understand the last cause of Reset
  * @param  None
  * @note   This function must set the next State Machine State
  * @retval None
  */
static void SFU_BOOT_SM_CheckStatusOnReset(void)
{
  TRACE("\r\n= [SBOOT] STATE: CHECK STATUS ON RESET");

  /* Check the wakeup sources */
  //RCC 플래그를 확인하여 재기동 원인 확인하고 메시지를 출력한다.
  SFU_BOOT_ManageResetSources();


#if (SECBOOT_LOADER == SECBOOT_USE_LOCAL_LOADER) || (SECBOOT_LOADER == SECBOOT_USE_STANDALONE_LOADER)
  /* When the local loader feature is supported we need to check if a local download is requested */
  //다운로드 체크 상태로 전환
  SFU_SET_SM_CURR_STATE(SFU_STATE_CHECK_NEW_FW_TO_DOWNLOAD);
#else
  /* When the local loader feature is disabled go directly to the check of the FW status */
  SFU_SET_SM_CURR_STATE(SFU_STATE_VERIFY_USER_FW_STATUS);
#endif /* (SECBOOT_LOADER == SECBOOT_USE_LOCAL_LOADER) || (SECBOOT_LOADER == SECBOOT_USE_STANDALONE_LOADER) */
}

#if (SECBOOT_LOADER == SECBOOT_USE_LOCAL_LOADER) || (SECBOOT_LOADER == SECBOOT_USE_STANDALONE_LOADER)
/**
  * @brief  Check if a new UserApp firmware is available for downloading.
  *         When entering this state from SFU_STATE_CHECK_STATUS_ON_RESET (initialDeviceStatusCheck=1) it is required
  *         to press the user button to force the local download.
  *         When entering this state from SFU_STATE_VERIFY_USER_FW_STATUS the local download is awaited automatically
  *         (because there is no other action to do).
  * @param  None
  * @note   This function must set the next State Machine State.
  * @retval None
  */
static void SFU_BOOT_SM_CheckNewFwToDownload(void)
{
  SFU_ErrorStatus  e_ret_status = SFU_ERROR;
#if (SECBOOT_LOADER == SECBOOT_USE_STANDALONE_LOADER)

  if (STANDALONE_LOADER_STATE == STANDALONE_LOADER_DWL_REQ)
  {
    TRACE("\r\n= [SBOOT] STATE: execution standalone loader");
    e_ret_status = SFU_BOOT_LaunchStandaloneLoader();

    /* This is unreachable code (dead code) in principle...
    At this point we should not be able to reach the following instructions.
    If we can execute them a critical issue has occurred.. So set the next State Machine accordingly */
    SFU_SET_SM_IF_CURR_STATE(e_ret_status, SFU_STATE_HANDLE_CRITICAL_FAILURE, SFU_STATE_HANDLE_CRITICAL_FAILURE);
    return;
  }
#endif /* (SECBOOT_LOADER == SECBOOT_USE_STANDALONE_LOADER) */

  //최초 진입인지 확인
  if (initialDeviceStatusCheck == 1U)
  {
    /* At boot-up, before checking the FW status, a local download can be forced thanks to the user button */
    //최초 진입인 경우 버튼 입력상태를 확인하여 다운로드 상태로 갈지 아니면 FW 체크 상태로 갈지 선택
    TRACE("\r\n= [SBOOT] STATE: CHECK NEW FIRMWARE TO DOWNLOAD");
    if (0U != BUTTON_PUSHED())
    {
      /* Download requested */
      e_ret_status = SFU_SUCCESS;
    }
    else
    {
      e_ret_status = SFU_ERROR;
    }
  }
  else
  {
    /*
     * The FW status has already been checked and no FW can be launched: no need to check the trigger, wait for a local
     * download to start
     */
    e_ret_status = SFU_SUCCESS;
  }

  /* Set the next State Machine state according to the success of the failure of e_ret_status */
  //입력 결과에 따라 SM 상태 선택
  SFU_SET_SM_IF_CURR_STATE(e_ret_status, SFU_STATE_DOWNLOAD_NEW_USER_FW, SFU_STATE_VERIFY_USER_FW_STATUS);

}
#endif /* (SECBOOT_LOADER == SECBOOT_USE_LOCAL_LOADER) || (SECBOOT_LOADER == SECBOOT_USE_STANDALONE_LOADER) */


/**
  * @brief  Check the Status of the Fw Image to work on  in order to set the next
  *         State Machine state accordingly
  * @param  None
  * @note   This function must set the next State Machine State
  * @retval None
  */
static void SFU_BOOT_SM_CheckUserFwStatus(void)
{
#if (SECBOOT_LOADER == SECBOOT_USE_STANDALONE_LOADER)
  SFU_ErrorStatus e_ret_status = SFU_ERROR;
#endif /* (SECBOOT_LOADER == SECBOOT_USE_STANDALONE_LOADER) */
  SFU_IMG_ImgInstallStateTypeDef e_PendingInstallStatus;
  uint32_t i;


  if (initialDeviceStatusCheck == 1U)
  {
    TRACE("\r\n= [SBOOT] STATE: CHECK USER FW STATUS");
  }

#if (SECBOOT_LOADER == SECBOOT_USE_STANDALONE_LOADER)
  if (STANDALONE_LOADER_STATE == STANDALONE_LOADER_INSTALL_REQ)
  {
    /* Read header in dwl slot */
    e_ret_status = SFU_LL_FLASH_Read((uint8_t *) &fw_image_header_validated, (uint8_t *) SlotStartAdd[SLOT_DWL_1],
                                     sizeof(SE_FwRawHeaderTypeDef));
    if (e_ret_status == SFU_SUCCESS)
    {
      /*
       * Notify the Secure Boot that a new image has been downloaded
       */
      e_ret_status = SFU_IMG_InstallAtNextReset((uint8_t *) &fw_image_header_validated);
    }
#if defined(SFU_VERBOSE_DEBUG_MODE)
    if (e_ret_status == SFU_ERROR)
    {
      TRACE("\r\n\t  Cannot memorize that a new image has been downloaded.");
    }
#endif /* SFU_VERBOSE_DEBUG_MODE */

    /* In all cases, standard SBSFU start-up at next reset */
    STANDALONE_LOADER_STATE = STANDALONE_LOADER_NO_REQ;
  }
#endif /* SECBOOT_LOADER == SECBOOT_USE_STANDALONE_LOADER */

  /* Check if there is a pending action related to a FW update procedure */
  //설치 시작 후 중지 상태인지, 설치 중 중지 상태인지 아니면 설치된 FW 가 없는 상태인지 확인
  e_PendingInstallStatus = SFU_IMG_CheckPendingInstallation(&m_DwlSlotToInstall, &m_ActiveSlotToResume,
                                                            &m_ActiveSlotToRollback);

  switch (e_PendingInstallStatus)
  {
    case SFU_IMG_FWIMAGE_ROLLBACK:
      /*
       * The new FW image has not been validated : rollback requested @ next reset
       * Rollback is done assuming the previous image was backed-up in corresponding dwl slot
       * As example : new image installed in SLOT_ACTIVE_2. Previous image was backed-up in SLOT_DWL_2
       */
      /* Identify corresponding backed-up slot */
      //롤백 필요시, 별도 정의를 하지 않는 경우 미사용
      m_DwlSlotToInstall = m_ActiveSlotToRollback - SLOT_ACTIVE_1 + SLOT_DWL_1;
      TRACE("\r\n\t  Installation not validated: rollback procedure initiated (SLOT_ACTIVE_%d / SLOT_DWL_%d)",
            m_ActiveSlotToRollback, m_DwlSlotToInstall - SLOT_DWL_1 + 1U);
      SFU_SET_SM_CURR_STATE(SFU_STATE_ROLLBACK_PREV_USER_FW);
      break;


    case SFU_IMG_FWUPDATE_STOPPED:
      /* The installation of a downloaded FW has been interrupted */
      /* We perform a resume of the installation */
      //설치 중에 중단된 경우, 설치 중에 중단된 경우에는 설치 재개 상태로 전환
      TRACE("\r\n\t  Installation Failed: resume installation procedure initiated (SLOT_ACTIVE_%d / SLOT_DWL_%d)",
            m_ActiveSlotToResume, m_DwlSlotToInstall - SLOT_DWL_1 + 1U);
      SFU_SET_SM_CURR_STATE(SFU_STATE_RESUME_INSTALL_NEW_USER_FW);
      break;

    case SFU_IMG_FWIMAGE_TO_INSTALL:
      /*
       * A new FW is detected in the dwl slot and ready to be installed
       */
      //다운로드 슬롯에 FW 가 있고 설치를 위해 재부팅한 경우 설치 실작
      TRACE("\r\n\t  New Fw to be installed from slot SLOT_DWL_%d", m_DwlSlotToInstall - SLOT_DWL_1 + 1U);
      SFU_SET_SM_CURR_STATE(SFU_STATE_INSTALL_NEW_USER_FW);
      break;

    case SFU_IMG_NO_FWUPDATE:
      /*
       * No FW image installation pending :
       *   1- Priority to MASTER_SLOT : check if a firmware is detected
       *   2- No firmware identified : verify other slots and start execution on the last detected firmware
       *   3- No active firmware candidate for execution ==> Local download
       *
       * This strategy can be adapted by removing for example execution of step2 ==> focus only on MASTER_SLOT.
       */
      //설치중이거나 설치할 FW 가 없는 경우
      m_ActiveSlotToExecute = 0U;

