eziya/STM32_SECURITY_LAB/TEST_PROJECTS/STM32CubeExpansion_SBSFU_V2.6.1/Projects/NUCLEO-L476RG/Applications/2_Images/2_Images_SBSFU/SBSFU/App/sfu_boot.c
  /*
   * Download area will be chosen as following. After header analysis :
   *   - same DWL slot number as SFU magic number, if the slot is configured.
   *     As example, we will choose SLOT_DWL_2 for SFU2 magic in the FW header
   *   - by default : SLOT_DWL_1
   */
  //Loader 를 실행하여 다운로드 슬롯에 fw 를 다운로드 받는다.
  //다운로드 받을 슬롯은 fw 헤더의 magic tag 값으로 확인하기 때문에 지정하지 않고 결정된 결과를 반환 받는다.
  e_ret_status = SFU_LOADER_DownloadNewUserFw(&e_ret_status_app, &dwl_slot, &u_size);
  if (e_ret_status == SFU_SUCCESS)
  {
#if defined(SFU_VERBOSE_DEBUG_MODE)
    TRACE("\r\n\t  FwSize=%d | PartialFwSize=%d | PartialFwOffset=%d | %d bytes received",
          fw_image_header_validated.FwSize, fw_image_header_validated.PartialFwSize,
          fw_image_header_validated.PartialFwOffset, u_size);
#endif /* SFU_VERBOSE_DEBUG_MODE */

    /* Read header in dwl slot */
    //다운로드 완료 후 다운로드 영역에서 헤더 정보를 읽는다.
    e_ret_status = SFU_LL_FLASH_Read((uint8_t *) &fw_image_header_validated, (uint8_t *) SlotStartAdd[dwl_slot],
                                     sizeof(SE_FwRawHeaderTypeDef));
  }

  if (e_ret_status == SFU_SUCCESS)
  {
    /*
     * Notify the Secure Boot that a new image has been downloaded
     * by calling the SE interface function to trigger the installation procedure at next reboot.
     */
    //다운로드가 완료되었으므로 리셋 후에 설치가 될 수 있도록 swap 영역에 헤더 정보를 남겨 놓는다.
    if (SFU_IMG_InstallAtNextReset((uint8_t *) &fw_image_header_validated) != SFU_SUCCESS)
    {
      /* Erase downloaded image */
      (void) SFU_IMG_EraseDownloadedImg(dwl_slot);

      /* no specific error cause set */
#if defined(SFU_VERBOSE_DEBUG_MODE)
      TRACE("\r\n\t  Cannot memorize that a new image has been downloaded.");
#endif /* SFU_VERBOSE_DEBUG_MODE */
    }
  }
  else
  {
    /* Erase downloaded image */
    //다운로드가 되지 않거나 헤더를 읽지 못하는 경우 다운로드 슬롯을 erase 하고 에러처리한다.
    (void) SFU_IMG_EraseDownloadedImg(dwl_slot);

    /* Memorize the specific error cause if any before handling this critical failure */
    switch (e_ret_status_app)
    {
      case SFU_LOADER_ERR_COM:
        SFU_EXCPT_SetError(SFU_EXCPT_COM_ERR);
        break;
      case SFU_LOADER_ERR_FW_VERSION:
        SFU_EXCPT_SetError(SFU_EXCPT_VERSION_ERR);
        break;
      case SFU_LOADER_ERR_FW_LENGTH:
        SFU_EXCPT_SetError(SFU_EXCPT_FW_TOO_BIG);
        break;
      case SFU_LOADER_ERR_AUTH_FAILED:
        SFU_EXCPT_SetError(SFU_EXCPT_HEADER_AUTH_ERR);
        break;
      case SFU_LOADER_ERR_FLASH:
        SFU_EXCPT_SetError(SFU_EXCPT_FLASH_ERR);
        break;
      case SFU_LOADER_ERR_CRYPTO:
        SFU_EXCPT_SetError(SFU_EXCPT_DECRYPT_ERR);
        break;
      default:
        /* no specific error cause */
        break;
    }
  } /* else error with no specific error cause */
  /* Set the next State Machine state according to the success of the failure of e_ret_status */
  //문제 없이 다운로드가 완료된 경우에는 reboot 하고 오류가 발생한 경우에는 예외처리한다.
  SFU_SET_SM_IF_CURR_STATE(e_ret_status, SFU_STATE_REBOOT_STATE_MACHINE, SFU_STATE_HANDLE_CRITICAL_FAILURE);
}
#endif /* SECBOOT_LOADER == SECBOOT_USE_STANDALONE_LOADER */

/**
  * @brief  Install the new UserApp Fw
  * @param  None
  * @note   This function must set the next State Machine State
  * @retval None
  */
static void SFU_BOOT_SM_InstallNewUserFw(void)
{
  SFU_ErrorStatus e_ret_status = SFU_ERROR;

  TRACE("\r\n= [SBOOT] STATE: INSTALL NEW USER FIRMWARE ");
  /* Double security check :
     - testing "static protections" twice will avoid basic hardware attack
     - flow control reached : dynamic protections checked
     - re-execute static then dynamic check
     - errors caught by FLOW_CONTROL ==> infinite loop */
  FLOW_CONTROL_CHECK(uFlowProtectValue, FLOW_CTRL_RUNTIME_PROTECT);
  FLOW_CONTROL_INIT(uFlowProtectValue, FLOW_CTRL_INIT_VALUE);

  //정적 보호 기능을 enable 한다.
  e_ret_status = SFU_LL_SECU_CheckApplyStaticProtections();
  FLOW_CONTROL_CHECK(uFlowProtectValue, FLOW_CTRL_STATIC_PROTECT);
  if (e_ret_status == SFU_SUCCESS)
  {
    //동적 보호 기능을 enable 한다.
    e_ret_status = SFU_LL_SECU_CheckApplyRuntimeProtections(SFU_SECOND_CONFIGURATION);
  }
  FLOW_CONTROL_CHECK(uFlowProtectValue, FLOW_CTRL_RUNTIME_PROTECT);
  if (e_ret_status != SFU_SUCCESS)
  {
    /*
     * Due to previous flow control, we should never reach this code  :
     * Critical failure management if installation failed
     */
    SFU_SET_SM_CURR_STATE(SFU_STATE_HANDLE_CRITICAL_FAILURE);
    return;
  }

  /* Check the candidate version vs current active version */
  //다운로드 영역에 있는 fw 의 버전과 현재 액티브 영역의 버전을 확인하여 설치가능 여부를 확인한다.
  e_ret_status = SFU_IMG_CheckCandidateVersion(m_DwlSlotToInstall);

  if (SFU_SUCCESS != e_ret_status)
  {
    /* Erase downloaded FW in case of authentication/integrity error */
    (void) SFU_IMG_EraseDownloadedImg(m_DwlSlotToInstall);
  }
  else
  {
    /* Secure coding : double check the candidate version vs current active version */
    //더블 체크한다.
    e_ret_status = SFU_IMG_CheckCandidateVersion(m_DwlSlotToInstall);
  }

  if (SFU_SUCCESS == e_ret_status)
  {
    /* Launch the Firmware Installation procedure */
    //다운로드 슬롯의 fw 가 문제가 없는 경우 설치를 완료한다.
    e_ret_status = SFU_IMG_TriggerImageInstallation(m_DwlSlotToInstall);
  }

  if (SFU_SUCCESS == e_ret_status)
  {
    /*
     * The FW installation succeeded: the previous FW is now backed up in the dwl slot.
     * Nothing more to do, in the next FSM state we are going to verify the FW again and execute it if possible.
     */
#if defined(SFU_VERBOSE_DEBUG_MODE)
    TRACE("\r\n\t  FW installation succeeded.");
#endif /* SFU_VERBOSE_DEBUG_MODE */
  }
  else
  {
    /*
     * The FW installation failed: we need to reboot and the resume procedure will be triggered at next boot.
     * Nothing more to do, the next FSM state (HANDLE_CRITICAL_FAILURE) will deal with it.
     */
#if defined(SFU_VERBOSE_DEBUG_MODE)
    TRACE("\r\n\t  FW installation failed!");
#endif /* SFU_VERBOSE_DEBUG_MODE */
  }

  /* Installation successful : reboot for next operations on other slots
       - installation
       - resume
       - rollback */
  if (SFU_SUCCESS == e_ret_status)
  {
    //정상적으로 설치된 경우에는 재부팅한다.
    SFU_BOOT_ForceReboot();
  }
  else
  {
    SFU_SET_SM_CURR_STATE(SFU_STATE_HANDLE_CRITICAL_FAILURE);
  }
}

/**
  * @brief  Execute a UserApp Fw installation resume
  * @param  None
  * @note   This function must set the next State Machine State
  * @retval None
  */
static void SFU_BOOT_SM_ResumeInstallNewUserFw(void)
{
  SFU_ErrorStatus e_ret_status = SFU_ERROR;

  TRACE("\r\n= [SBOOT] STATE: RESUME INSTALLATION OF NEW USER FIRMWARE");

