eziya/STM32_SECURITY_LAB/TEST_PROJECTS/STM32CubeExpansion_SBSFU_V2.6.1/Projects/NUCLEO-L476RG/Applications/2_Images/2_Images_SBSFU/SBSFU/App/sfu_boot.c
  /*
   * This resume installation procedure continue installation of new User FW in the active slot
   */
  //설치중에 중단된 경우 설치를 resume 한다.
  e_ret_status = SFU_IMG_TriggerResumeInstallation(m_ActiveSlotToResume, m_DwlSlotToInstall);

  /* Installation successful : reboot for next operations on other slots
       - installation
       - resume
       - rollback */
  //설치가 완료된 경우 reboot 한다.
  if (SFU_SUCCESS == e_ret_status)
  {
    SFU_BOOT_ForceReboot();
  }
  else
  {
    /* No specific error cause managed here because the FSM state already provides the information. */
    //오류가 발생한 경우에는 오류 상태로 전환한다.
    SFU_SET_SM_CURR_STATE(SFU_STATE_HANDLE_CRITICAL_FAILURE);
  }
}

/**
  * @brief  Execute a rollback to the previous UserApp Fw
  * @param  None
  * @note   This function must set the next State Machine State
  * @retval None
  */
static void SFU_BOOT_SM_RollbackInstallPrevUserFw(void)
{  TRACE("\r\n= [SBOOT] STATE: ROLLBACK NOT SUPPORTED");

  /* No specific error cause managed here because the FSM state already provides the information. */
  SFU_SET_SM_CURR_STATE(SFU_STATE_HANDLE_CRITICAL_FAILURE);
}


/**
  * @brief  Verify the UserApp Fw signature before executing it
  * @param  None
  * @note   This function must set the next State Machine State
  * @retval None
  */
static void SFU_BOOT_SM_VerifyUserFwSignature(void)
{
  SFU_ErrorStatus e_ret_status = SFU_ERROR;
  uint32_t i;

  TRACE("\r\n= [SBOOT] STATE: VERIFY USER FW SIGNATURE");

  //액티브 슬롯의 fw 를 실행하기 이전에 fw signature 를 검증한다.

  /* Double security check :
     - testing "static protections" twice will avoid basic hardware attack
     - flow control reached : dynamic protections checked
     - re-execute static then dynamic check
     - errors caught by FLOW_CONTROL ==> infinite loop */
  FLOW_CONTROL_CHECK(uFlowProtectValue, FLOW_CTRL_RUNTIME_PROTECT);
  FLOW_CONTROL_INIT(uFlowProtectValue, FLOW_CTRL_INIT_VALUE);
  //정적 보호 기능을 enable 한다.
  e_ret_status = SFU_LL_SECU_CheckApplyStaticProtections();
  FLOW_CONTROL_CHECK(uFlowProtectValue, FLOW_CTRL_STATIC_PROTECT);
  if (e_ret_status == SFU_SUCCESS)
  {
    //동적 보호 기능을 enable 한다.
    e_ret_status = SFU_LL_SECU_CheckApplyRuntimeProtections(SFU_THIRD_CONFIGURATION);
  }
  FLOW_CONTROL_CHECK(uFlowProtectValue, FLOW_CTRL_RUNTIME_PROTECT);
  if (e_ret_status != SFU_SUCCESS)
  {
    /*
     * Due to previous flow control, we should never reach this code  :
     * Critical failure management if installation failed
     */
    SFU_SET_SM_CURR_STATE(SFU_STATE_HANDLE_CRITICAL_FAILURE);
    return;
  }

  /*
   * With the 2 images handling:
   *       1. the header signature is verified  when installing a new firmware
   *       2. the firmware signature is checked when installing a new firmware
   *       3. remaining part of active slot is kept "clean" during installation procedure
   * So following checks should never fail.
   */
  /* Check all active slots configured */
  for (i = 0U; i < SFU_NB_MAX_ACTIVE_IMAGE; i++)
  {
    /* Slot configured ? */
    if (SlotStartAdd[SLOT_ACTIVE_1 + i] != 0U)
    {
      /* FW installed ? */
      //액티브 슬롯에 fw 가 있는지 확인한다.
      if (SFU_SUCCESS == SFU_IMG_DetectFW(SLOT_ACTIVE_1 + i))
      {
        /* Initialize Flow control */
        FLOW_CONTROL_INIT(uFlowCryptoValue, FLOW_CTRL_INIT_VALUE);

        /* Check the header signature */
        //액티브 슬롯의 헤더 signature 를 검증한다.
        e_ret_status = SFU_IMG_VerifyActiveImgMetadata(SLOT_ACTIVE_1 + i);
        if (SFU_SUCCESS == e_ret_status)
        {
          /* Check the FW signature */
          //액티브 슬롯의 fw signature 를 검증한다.
          e_ret_status = SFU_IMG_VerifyActiveImg(SLOT_ACTIVE_1 + i);
          if (SFU_SUCCESS == e_ret_status)
          {
            /* Verify that there is no additional code beyond firmware image */
            //액티브 slot 에 fw 외 다른 코드가 없는지 검증한다.
            e_ret_status = SFU_IMG_VerifyActiveSlot(SLOT_ACTIVE_1 + i);
            if (SFU_SUCCESS != e_ret_status)
            {
#if defined(SFU_VERBOSE_DEBUG_MODE)
              TRACE("\r\n\t  Unexpected code beyond FW image in slot SLOT_ACTIVE_%d", SLOT_ACTIVE_1 + i);
#endif /* SFU_VERBOSE_DEBUG_MODE */
            }
          }
          else
          {
#if defined(SFU_VERBOSE_DEBUG_MODE)
            TRACE("\r\n\t  Firmware signature verification failure in slot SLOT_ACTIVE_%d", SLOT_ACTIVE_1 + i);
#endif /* SFU_VERBOSE_DEBUG_MODE */
          }
        }
        else
        {
#if defined(SFU_VERBOSE_DEBUG_MODE)
          TRACE("\r\n\t  Header signature verification failure in slot SLOT_ACTIVE_%d", SLOT_ACTIVE_1 + i);
#endif /* SFU_VERBOSE_DEBUG_MODE */
        }
        /*
         * One of the checks fails :
         *  - Header signature
         *  - FW signature
         *  - No malicious code
         *  ==> Active slot should be invalidated
         */
        if (SFU_SUCCESS != e_ret_status)
        {
          /*
           * We should never reach this code.
           * Could come from an attack ==> as an example we invalidate current firmware.
           */
          //액티브 슬롯의 검증에서 오류가 발생한 경우 현재 액티브 슬롯의 fw 를 삭제한다. (헤더 제외)
#if defined(SFU_VERBOSE_DEBUG_MODE)
          TRACE("\r\n\t  Erasing slot SLOT_ACTIVE_%d", SLOT_ACTIVE_1 + i);
#endif /* SFU_VERBOSE_DEBUG_MODE */
          (void)SFU_IMG_InvalidateCurrentFirmware(SLOT_ACTIVE_1 + i); /* If this fails we continue anyhow */
        }
        else
        {
          /* Verify if authentication and integrity controls performed */
          FLOW_CONTROL_CHECK(uFlowCryptoValue, FLOW_CTRL_INTEGRITY);
        }
      }
      else
      {
        //액티브 슬롯에 fw 가 없는 경우 clean 한지 검증한다.
        if (SFU_IMG_VerifyEmptyActiveSlot(SLOT_ACTIVE_1 + i) != SFU_SUCCESS)
        {
          /*
           * We should never reach this code.
           * Could come from an attack ==> as an example we invalidate current firmware.
           */
          //clean 하지 않다면 액티브 슬롯의 fw 를 삭제한다. (헤더 제외)
#if defined(SFU_VERBOSE_DEBUG_MODE)
          TRACE("\r\n\t  Slot SLOT_ACTIVE_%d not empty : erasing ...", SLOT_ACTIVE_1 + i);
#endif /* SFU_VERBOSE_DEBUG_MODE */
          (void)SFU_IMG_InvalidateCurrentFirmware(SLOT_ACTIVE_1 + i); /* If this fails we continue anyhow */
        }
      }
    }
  }

  /* Set the next State Machine state according to the success of the failure of e_ret_status */
  // 오류가 없다면 액티브 slot 이 정상적이기 때문에 fw 를 실행한다.
  SFU_SET_SM_IF_CURR_STATE(e_ret_status, SFU_STATE_EXECUTE_USER_FW, SFU_STATE_HANDLE_CRITICAL_FAILURE);
}

/**
  * @brief  Exit from the SB/SFU State Machine and try to execute the UserApp Fw
  * @param  None
  * @note   This function must set the next State Machine State
  * @retval None
  */
static void SFU_BOOT_SM_ExecuteUserFw(void)
{
  SFU_ErrorStatus e_ret_status = SFU_ERROR;
  SE_StatusTypeDef e_se_status = SE_KO;
  uint32_t i;

  TRACE("\r\n= [SBOOT] STATE: EXECUTE USER FIRMWARE");

  /* Reload Watchdog */
  (void) SFU_LL_SECU_IWDG_Refresh();

  /* Verify if authentication and integrity controls performed at SFU_STATE_VERIFY_USER_FW_SIGNATURE */
  FLOW_CONTROL_CHECK(uFlowCryptoValue, FLOW_CTRL_INTEGRITY);

  /* Double security check for all active slots :
     - Control twice the Header signature will avoid basic hardware attack
     - Control twice the FW signature will avoid basic hardware attack */

  /* Check all active slots configured */
  for (i = 0U; i < SFU_NB_MAX_ACTIVE_IMAGE; i++)
  {
    /* Slot configured ? */
    if (SlotStartAdd[SLOT_ACTIVE_1 + i] != 0U)
    {
      /* FW installed ? */
      //액티브 슬롯에 fw 가 있는지 확인한다.
      if (SFU_SUCCESS == SFU_IMG_DetectFW(SLOT_ACTIVE_1 + i))
      {
        /* Initialize Flow control */
        FLOW_CONTROL_INIT(uFlowCryptoValue, FLOW_CTRL_INIT_VALUE);

